---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.TorsionalMomentOfInertia
source: html/26d9558e-ef79-6b2b-b32b-a18091e0f0f5.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.TorsionalMomentOfInertia Property

Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation

## Syntax (C#)
```csharp
public double TorsionalMomentOfInertia { get; set; }
```